; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star2 - direction
	GroundStation10 - direction
	Star4 - direction
	GroundStation0 - direction
	Star9 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star4)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star4)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Planet11 image0)
	(have_image Planet12 image0)
	(have_image Star13 infrared1)
	(have_image Planet14 image0)
	(have_image Planet15 image0)
	(have_image Planet16 image0)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 8
3. (turn_to satellite1 planet14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet14)
   goals met: 0 of 8
4. (take_image satellite1 planet14 instrument3 image0)
   added: (have_image planet14 image0)
   goals met: 1 of 8
5. (turn_to satellite1 planet12 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet12)
   goals met: 1 of 8
6. (take_image satellite1 planet12 instrument3 image0)
   added: (have_image planet12 image0)
   goals met: 2 of 8
7. (turn_to satellite1 phenomenon17 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 8
8. (take_image satellite1 phenomenon17 instrument3 image0)
   added: (have_image phenomenon17 image0)
   goals met: 3 of 8
9. (turn_to satellite1 planet15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet15)
   goals met: 3 of 8
10. (take_image satellite1 planet15 instrument3 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 8
11. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 4 of 8
12. (take_image satellite1 planet16 instrument3 image0)
   added: (have_image planet16 image0)
   goals met: 5 of 8
13. (turn_to satellite1 star13 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star13)
   goals met: 5 of 8
14. (take_image satellite1 star13 instrument3 infrared1)
   added: (have_image star13 infrared1)
   goals met: 6 of 8
15. (turn_to satellite1 planet11 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet11)
   goals met: 7 of 8
16. (take_image satellite1 planet11 instrument3 image0)
   added: (have_image planet11 image0)
   goals met: 8 of 8
